app/controllers/sensor/v1/env_data_controller.rb

SELECT  "plants".* FROM "plants" WHERE "plants"."sensor_id" = $1 LIMIT $2  [["sensor_id", 1], ["LIMIT", 1]]
---
      def show
        @env_info = EnvDatum.where(sensor_id: params[:sensor_id])
        @plant = Plant.find(params[:sensor_id])

UPDATE "plants" SET "last_record" = $1, "updated_at" = $2 WHERE "plants"."sensor_id" = $3  [["last_record", "2017-09-09 06:41:12.848641"], ["updated_at", "2017-09-09 06:41:12.867753"], ["sensor_id", 1]]
---
      def create
         @env_datum = EnvDatum.new(env_datum_params)
         if @env_datum.save
           render json: {status: 'SUCCESS', message: 'Saved Data', data: @env_datum}, status: :ok
         else
           render json: {status: 'ERROR', message: 'Data not saved',
             data: @env_datum.errors}, status: :unprocessable_entity
         end

         data_time = EnvDatum.select('record_time').reverse_order.limit(1)
         puts data_time.inspect
         Plant.update(params[:sensor_id],last_record: data_time[0].record_time)