app/controllers/sensor/v1/plants_controller.rb

      def index
        @plant = Plant.order('sensorID DESC');
---
SELECT "plants".* FROM "plants" ORDER BY plants.sensor_id DESC

      def create
        @plant = Plant.new(plant_params)

        if @plant.save
---
INSERT INTO "plants" ("sensor_id", "name", "sci_name", "nickname", "zipcode", "notes", "created_at", "updated_at", "owner_id") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9) RETURNING "sensor_id"