app/views/welcome/dashboard.html.erb

SELECT  "plants"."name", soil_conduct, temp, light FROM "plants" JOIN env_data ON plants.last_record = env_data.record_time WHERE "plants"."owner_id" = $1 LIMIT $2  [["owner_id", 1], ["LIMIT", 11]]
SELECT SUM(soil_conduct) AS sum_soil_conduct, "plants"."name" AS plants_name FROM "plants" INNER JOIN env_data ON env_data.record_time = plants.last_record WHERE "plants"."owner_id" = $1 GROUP BY "plants"."name"  [["owner_id", 1]]
---
    <div class="container-fluid col-sm-9">
        <%= bar_chart Plant.joins("INNER JOIN env_data ON env_data.record_time = plants.last_record").where(owner_id: current_user.id).group(:name).sum(:soil_conduct) %>