app/views/sensor/v1/env_data/show.html.erb

      <h2>Temp</h2>
      <%= line_chart @env_data.group_by_minute(:record_time).maximum(:temp) %>
---
SELECT MAX("env_data"."temp") AS maximum_temp, EXTRACT(DOW from record_time::timestamptz AT TIME ZONE 'Etc/UTC' - INTERVAL '0 second')::integer AS extract_dow_from_record_time_timestamptz_at_time_zone_etc_utc_i FROM "env_data" WHERE "env_data"."sensor_id" = $1 AND (record_time IS NOT NULL) GROUP BY EXTRACT(DOW from record_time::timestamptz AT TIME ZONE 'Etc/UTC' - INTERVAL '0 second')::integer  [["sensor_id", 1]]