app/controllers/accounts_controller.rb

  def create
    @account = Account.new(account_params)
    if @account.save
---
INSERT INTO "accounts" ("subdomain", "owner_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["subdomain", "banant2"], ["owner_id", 1], ["created_at", "2017-07-24 23:53:42.944028"], ["updated_at", "2017-07-24 23:53:42.944028"]]