app/controllers/welcome_controller.rb

  def dashboard
    authenticated_plants = Plant.select('sensor_id', 'name').where(owner_id: current_user.id)

    l = authenticated_plants.length
---
SELECT "plants"."sensor_id", "plants"."name" FROM "plants" WHERE "plants"."owner_id" = $1  [["owner_id", 1]]
SELECT MAX("plants"."sensor_id") AS maximum_sensor_id, "plants"."name" AS plants_name FROM "plants" GROUP BY "plants"."name"